[
    {
        "ratings": {
            "\n            5 star\n          ": "\n          ",
            "\n            4 star\n          ": "\n          ",
            "\n            3 star\n          ": "\n          ",
            "\n            2 star\n          ": "\n          ",
            "\n            1 star\n          ": "\n          "
        },
        "reviews": [
            {
                "review_comment_count": "",
                "review_text": "It's a really good phone. The only issue i have, is that mine didn't come with a voicemail app and it never gives me voicemail notifications. I have to just periodically call my voicemail and boost isn't compatible with third party voicemail apps from the play store. Other than that, i love the phone. The camera and camcorder are good quality. It doesn't like to auto focus very well and i often have to tap the screen where it needs to focus, but that's not a big deal. I love the native flashlight app so that i don't have to clutter my phone with a flashlight app from the playstore. I love the front flash. It has come in very handy both for selfies and when I've had to use my camera as a makeup mirror. It has a very decent size internal memory. I thought it came with fm radio and was a little disappointed to find that it didn't. I also like the built in themes (I'm not sure if that's because of the phone itself or the marshmallow os. I upgraded from a galaxy prevail lte running kit kat os) and the phone's capability to do a couple things that have required root on previous devices. It's a pretty study and well built phone. I've dropped it a couple times before i got my case and there is very little damage. The phone is an excellent bargain. It's well worth what i paid and then some. I only rated 4 stars because of the complete lack of native voicemail app and inability to use any third party voicemail apps.",
                "review_posted_date": null,
                "review_header": "Great Phone For The Price",
                "review_rating": "4.0 ",
                "review_author": "Kristen"
            },
            {
                "review_comment_count": "",
                "review_text": "I love this Samsung J7, since it is bigger than the s6 and s7, and as good as my old S5 (as compared in the images). I had no issues charging it or switching it over from old phone to this new phone - via a 4 minute phone call to Boostmobile. Yes, the S6 and S7 have -much- faster processors, but I do not need that for what I do... and so far, after 1 month of use, I absolutely love this phone!. The phone feels great, responds quickly, and looks freaking awesome. Pros: -Great price -AFFORDABLE! -Bigger than most other phones available -Great quality screen Cons: -2 bottom buttons- on side of the main home button- DO NOT light up -Camera is not comparable to that of the S5, S6, and S7 -Overall quality does not feel as sturdy as the other models mentioned (Shell plastic is thinner). After one month of use, I rated this phone with 4 stars. I will be updating this review in about 6 months. REVIEW UPDATE: February 19, 2017 After eight (8) months of owning this phone, and 7 months since this original review, I am back today to continue my review as promised. I am doing 2 things for those of you who are reading this review for the first time: 1) I have added a star to make this a 5 star review! 2) I will explain why I have decided to come back to add this star to my review. Let me clarify that since reviewing this, I have purchased a second one for my wife. I will also list what items I purchased it along with: Mr Shield Tempered Glass Screen Protector for Samsung Galaxy J7 [Will Not Fit For 2016 Version] - 2-Pack Samsung EVO 64GB Micro SDXC Memory Card with Adapter up to 48/MB/s (MB-MP64DA/AM) Phonelicious SAMSUNG Galaxy J7 Case(Boost,Virgin,TMobile,Metro PCS)Slim Fit Heavy Duty Ultimate Drop Protection Rugged Cover with Screen Protector & Stylus (Navy Blue Matte) Of course, purchasing a case, the Screen protector, and a good quality memory card may also influence how this product has performed. This phone continues to work as expected, and has delivered so far. I feel my investment on this phone has paid off, and my money has been worth. Being a somewhat frugal shopper, I thought I would give this phone a try to since it's price was reasonable for what I was getting. My 1 year old (who is now 18 months) has used and abused this phone. He has thrown it on the floor dozens of times, and has scratched, as well chewed on it. What has happened to the phone so far? - It has gained a large crack, on the screen protector. The phone is still working as it did 8 months ago, and the cheap items I purchased to protected have taken quite the toll. I had originally mentioned that the phone felt \"cheap\", and the thin plastic that it is made out of, is certainly noticeable compared to the quality of the S5, and other S series for that matter. Given that this phone has performed well, continues to deliver, and has outlasted quite some abuse, I made the judgement to give this phone the extra star, since this is a great product to my standards. I plan to come back in June, and review this item again after a full year of use!",
                "review_posted_date": null,
                "review_header": "Best phone I have owned with Boostmobile!",
                "review_rating": "5.0 ",
                "review_author": "JLO JLO"
            },
            {
                "review_comment_count": "",
                "review_text": "So far so good. Although it did load a bunch of apps I'll never use that I need to delete. Photos are good, even low light, especially if you're used to a lousy camera. If you're used to the pricey Galaxy or an iPhone (that finally caught up to the Galaxy) then this might not satisfy; but it's good enough for IG and selling online. Battery life seems acceptable - if I'm on it a lot (every hour for 10-30 minutes) it lasts a full day and change. Charges quickly. Easy to navigate overall. Trying to figure out using two different browsers concurrently so I can be on both my IG accounts w/o signing out. I don't watch much video, although it did get a little warm, nothing alarming. I only watched about an hour of youtube. Texting font is legible for any age. VERY slippery - I haven't dropped it yet, but did order a mongo strong case (I'm hoping) - hopefully won't drop it before the case gets here!! It is also pretty big for a smaller hand/pocket- the irony of tiny phones in the naughts to these skinny but big phone/computers now. Price point of $150 was very good. Totally a very good value for the price.",
                "review_posted_date": null,
                "review_header": "Galaxy J7 - Perfect for an average user functionally - but SLIPPERY",
                "review_rating": "4.0 ",
                "review_author": "Amazon Customer"
            },
            {
                "review_comment_count": "",
                "review_text": "So i bought my J3 back in January 2017 and i used it for about a year and a half. the price then was less than $150 USD. i am not sure why they are selling for $300+ after 3+ years. The phone worked great when I had it. I recently had issues with my (upgraded) phone and had to dig this one out for backup use. The reason why i upgraded my phone was because my battery was going out and a new phone was more appealing to me at the time. Other than the battery (which is 3+ years old), it hasn't been giving me any issues. I know picture quality is good, screen quality is there, battery life (when new) was great. At the moment, I have to leave it plugged in for long periods of time. There is a setting called \"Extended Battery Life\" where you can limit all the application's background use. This setting is extremely useful when you need to go more than one day between charges, just be mindful of which applications you use, because some applications drain the battery more than others. The only other complaint that I had (when this phone was my main cell phone) was that the internal memory wasn't big enough. My phone at the time was mainly for game use. Now it is more of a phone.",
                "review_posted_date": null,
                "review_header": "Recently dug it out as my backup phone",
                "review_rating": "5.0 ",
                "review_author": "DanielM."
            }
        ],
        "url": "https://www.amazon.com/dp/B01ETPUQ6E",
        "name": "Samsung Galaxy J7 - No Contract Phone - White - (Boost Mobile)(Carrier locked phone )",
        "price": ""
    },
    {
        "ratings": {},
        "reviews": [],
        "url": "https://www.amazon.com/dp/B017HW9DEW",
        "name": "",
        "price": ""
    },
    {
        "ratings": {},
        "reviews": [],
        "url": "https://www.amazon.com/dp/B00U8KSIOM",
        "name": "",
        "price": ""
    }
]